<?php

#[NameOfAttribute]
class NameOfClass1 {
    #[ExampleAttributeMethod('foo', 'bar')]
    private function method1(#[FooParamAttrib('Foo1')] $foo) {
    }
}

#[ExampleAttribute('foo', 'bar')]
class NameOfClass2 {
}

#[Attr]
#[FooAttr]
class NameOfClass3 {
}

#[Attr, FooAttr]
class NameOfClass4 {
}

#[Attribute(Attribute::TARGET_CLASS | Attribute::TARGET_METHOD)]
class NameOfClass5 {
}

#[ConstAttr]
#[FooAttribute(null)]
class NameOfClass6 {
}
-----
Block#1
    Stmt_Class
        name: NameOfClass1
        attrGroup[0]:
            attr[0]:
                name: LITERAL('NameOfAttribute')
        stmts: Block#2
    Stmt_Class
        name: NameOfClass2
        attrGroup[0]:
            attr[0]:
                name: LITERAL('ExampleAttribute')
                args[0]: LITERAL('foo')
                args[1]: LITERAL('bar')
        stmts: Block#3
    Stmt_Class
        name: NameOfClass3
        attrGroup[0]:
            attr[0]:
                name: LITERAL('Attr')
        attrGroup[1]:
            attr[0]:
                name: LITERAL('FooAttr')
        stmts: Block#4
    Stmt_Class
        name: NameOfClass4
        attrGroup[0]:
            attr[0]:
                name: LITERAL('Attr')
            attr[1]:
                name: LITERAL('FooAttr')
        stmts: Block#5
    Expr_ClassConstFetch
        class: LITERAL('Attribute')
        name: LITERAL('TARGET_CLASS')
        result: TEMP(#1)
    Expr_ClassConstFetch
        class: LITERAL('Attribute')
        name: LITERAL('TARGET_METHOD')
        result: TEMP(#2)
    Expr_BinaryOp_BitwiseOr
        left: TEMP(#1)
        right: TEMP(#2)
        result: TEMP(#3)
    Stmt_Class
        name: NameOfClass5
        attrGroup[0]:
            attr[0]:
                name: LITERAL('Attribute')
                args[0]: TEMP(#3)
        stmts: Block#6
    Expr_ConstFetch
        name: LITERAL('null')
        result: TEMP(#4)
    Stmt_Class
        name: NameOfClass6
        attrGroup[0]:
            attr[0]:
                name: LITERAL('ConstAttr')
        attrGroup[1]:
            attr[0]:
                name: LITERAL('FooAttribute')
                args[0]: TEMP(#4)
        stmts: Block#7
    Terminal_Return

Block#2
    Stmt_ClassMethod
        name: method1
        flags: private
        attrGroup[0]:
            attr[0]:
                name: LITERAL('ExampleAttributeMethod')
                args[0]: LITERAL('foo')
                args[1]: LITERAL('bar')

Block#3

Block#4

Block#5

Block#6

Block#7

Function 'NameOfClass1::method1': mixed
Block#1
    Expr_Param
        declaredType: mixed
        name: LITERAL('foo')
        result: TEMP(#1 <VARIABLE($foo)>)
        attrGroup[0]:
            attr[0]:
                name: LITERAL('FooParamAttrib')
                args[0]: LITERAL('Foo1')
    Terminal_Return